; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
; params: satgen 307183 2 2 2 6 5
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	spectrograph0 - mode
	thermograph1 - mode
	Star0 - direction
	GroundStation2 - direction
	GroundStation4 - direction
	GroundStation3 - direction
	GroundStation5 - direction
	GroundStation1 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Star9 - direction
	Star10 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 GroundStation5)
	(calibration_target instrument0 GroundStation3)
	(supports instrument1 spectrograph0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 GroundStation3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument2 thermograph1)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 GroundStation5)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation4)
)
(:goal (and
	(have_image Planet6 spectrograph0)
	(have_image Star7 spectrograph0)
	(have_image Planet8 spectrograph0)
	(have_image Star9 spectrograph0)
	(have_image Star10 spectrograph0)
))

)

; plan
1. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 5
3. (turn_to satellite0 groundstation3 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 5
4. (turn_to satellite1 star7 groundstation4)
   deleted: (pointing satellite1 groundstation4)
   added: (pointing satellite1 star7)
   goals met: 0 of 5
5. (calibrate satellite0 instrument0 groundstation3)
   added: (calibrated instrument0)
   goals met: 0 of 5
6. (turn_to satellite1 star10 star7)
   deleted: (pointing satellite1 star7)
   added: (pointing satellite1 star10)
   goals met: 0 of 5
7. (turn_to satellite0 star9 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star9)
   goals met: 0 of 5
8. (turn_to satellite1 planet8 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 planet8)
   goals met: 0 of 5
9. (take_image satellite0 star9 instrument0 spectrograph0)
   added: (have_image star9 spectrograph0)
   goals met: 1 of 5
10. (turn_to satellite1 star10 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 star10)
   goals met: 1 of 5
11. (turn_to satellite0 star7 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star7)
   goals met: 1 of 5
12. (turn_to satellite1 planet8 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 planet8)
   goals met: 1 of 5
13. (take_image satellite0 star7 instrument0 spectrograph0)
   added: (have_image star7 spectrograph0)
   goals met: 2 of 5
14. (turn_to satellite1 planet6 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 planet6)
   goals met: 2 of 5
15. (turn_to satellite0 star10 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star10)
   goals met: 2 of 5
16. (turn_to satellite1 planet8 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 planet8)
   goals met: 2 of 5
17. (take_image satellite0 star10 instrument0 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 3 of 5
18. (turn_to satellite1 groundstation1 planet8)
   deleted: (pointing satellite1 planet8)
   added: (pointing satellite1 groundstation1)
   goals met: 3 of 5
19. (turn_to satellite0 planet6 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 planet6)
   goals met: 3 of 5
20. (calibrate satellite1 instrument2 groundstation1)
   added: (calibrated instrument2)
   goals met: 3 of 5
21. (take_image satellite0 planet6 instrument0 spectrograph0)
   added: (have_image planet6 spectrograph0)
   goals met: 4 of 5
22. (turn_to satellite1 planet8 groundstation1)
   deleted: (pointing satellite1 groundstation1)
   added: (pointing satellite1 planet8)
   goals met: 4 of 5
23. (take_image satellite1 planet8 instrument2 spectrograph0)
   added: (have_image planet8 spectrograph0)
   goals met: 5 of 5
